{
  "Java Interview": {
    "Beginner": [
      "What is polymorphism in Java?",
      "Explain the concept of inheritance in Java.",
      "What is a constructor in Java?",
      "What is the purpose of the 'this' keyword in Java?",
      "How do you define a class in Java?",
      "What is an object in Java?",
      "What is method overloading in Java?",
      "What is method overriding in Java?",
      "What are access modifiers in Java?",
      "What is the difference between '==' and 'equals()' in Java?",
      "What is a package in Java?",
      "What is the use of the 'super' keyword in Java?",
      "What is an interface in Java?",
      "What is an abstract class in Java?",
      "How do you implement multiple inheritance in Java?",
      "What is a static variable in Java?",
      "What is a static method in Java?",
      "What is a static block in Java?",
      "What is a final variable in Java?",
      "What is a final method in Java?",
      "What is a final class in Java?",
      "What is the 'instanceof' keyword in Java?",
      "What is the 'transient' keyword in Java?",
      "What is the 'synchronized' keyword in Java?",
      "What is the 'volatile' keyword in Java?",
      "What is exception handling in Java?",
      "What is a try-catch block in Java?",
      "What is a finally block in Java?",
      "What is a throw statement in Java?",
      "What is the difference between checked and unchecked exceptions in Java?"
    ],
    "Intermediate": [
      "What is the difference between abstract class and interface?",
      "How does garbage collection work in Java?",
      "Explain the use of the final keyword in Java.",
      "What are Java Generics?",
      "What is the Collections Framework in Java?",
      "Solve the Dutch National Flag problem.",
      "What is a thread in Java?",
      "What is multithreading in Java?",
      "What is synchronization in Java?",
      "What is a deadlock in Java?",
      "What is a race condition in Java?",
      "What is a semaphore in Java?",
      "What is a mutex in Java?",
      "What is the difference between HashMap and HashSet in Java?",
      "What is the difference between ArrayList and LinkedList in Java?",
      "What is a PriorityQueue in Java?",
      "What is a TreeMap in Java?",
      "What is a LinkedHashMap in Java?",
      "What is the difference between Comparable and Comparator in Java?",
      "What is the Observer design pattern in Java?"
    ],
    "Hard": [
      "Explain the Singleton design pattern.",
      "How do you optimize performance in Java applications?",
      "What is the difference between HashMap and ConcurrentHashMap?",
      "How does the Java Memory Model work?",
      "What is the purpose of the volatile keyword in Java?",
      "What is the Producer-Consumer problem in Java?",
      "What is the Fork-Join framework in Java?",
      "What is the Java NIO package?",
      "What is a memory leak in Java?",
      "What is the difference between a Stack and a Heap in Java?"
    ]
  },
  "Excel Interview": {
    "Beginner": [
      "What are the different data formats available in Excel?",
      "How can you wrap text in Excel?",
      "How can you merge cells in Excel?",
      "What is ‘Format Painter’ used for?",
      "How would you clear all the formatting without removing the cell contents?",
      "What is Conditional Formatting?",
      "How would you highlight cells with negative values in it?",
      "How would you highlight cells with duplicate values in it?",
      "How would you highlight cells with errors in it?",
      "How can you make text invisible in Excel?",
      "What is the order of operations used when evaluating formulas in Excel?",
      "What is the difference between a function and a formula in Excel?",
      "What are the top 5 functions in Excel?",
      "What is the difference between absolute and relative cell references?",
      "What are the different types of errors you can encounter in Excel?",
      "Which function would you use to get the current date and time in Excel?",
      "How can you combine the text from multiple cells using a formula?",
      "What formula would you use to find the length of a text string in a cell?",
      "What is the syntax of the VLOOKUP function?",
      "How would you get rid of leading/trailing/double spaces in a text in Excel?",
      "What are the known limitations of the VLOOKUP function?",
      "When would you use the SUBTOTAL function?",
      "What are volatile functions? Can you name a few?",
      "What is the shortcut for opening the find and replace dialog box?",
      "What is the shortcut for spell check?",
      "How can you select all the cells in the worksheet?",
      "How would you insert a new line in the same cell?",
      "What is a Pivot Table, and when would you use one?",
      "How can you refresh a Pivot Table?",
      "What are slicers in Pivot Tables?"
    ],
    "Intermediate": [
      "What are Calculated Fields in Pivot Table?",
      "What is a secondary axis in a chart?",
      "How can you sort data in Excel?",
      "What is data validation?",
      "How can you transpose a data set in Excel?",
      "How can you select all blank cells in Excel?",
      "How can you remove duplicates from a data set?",
      "What is an advanced filter in Excel?",
      "Can you sort multiple columns at one time?",
      "What is a one-variable data table?",
      "What is a two-variable data table?",
      "What is Scenario Manager in Excel?",
      "What is Goal Seek?",
      "What is a Solver in Excel?",
      "What is VBA in Excel?",
      "What are the benefits of using VBA in Excel?",
      "What is a macro in Excel?",
      "How can you record a macro in Excel?",
      "What are some limitations of recording a macro in Excel?",
      "What is a UDF in Excel VBA?"
    ],
    "Hard": [
      "What are Events in VBA?",
      "What are some of the useful loops in VBA?",
      "What are the different ways to run a macro in Excel?",
      "What are UserForms in Excel VBA?",
      "What are add-ins in Excel?",
      "What is the difference between a dashboard and a report?",
      "What are some of the questions you should ask a client/stakeholder before creating a dashboard?",
      "What are some interactive controls you can use in dashboards?",
      "What are some best practices when creating a dashboard in Excel?",
      "What are wildcard characters in Excel?"
    ]
  },
  "Python Interview": {
    "Beginner": [
      "What is Python? List some popular applications of Python in the world of technology.",
      "What are the benefits of using Python language as a tool in the present scenario?",
      "Is Python a compiled language or an interpreted language?",
      "What does the ‘#’ symbol do in Python?",
      "What is the difference between a Mutable datatype and an Immutable data type?",
      "How are arguments passed by value or by reference in Python?",
      "What is the difference between a Set and Dictionary?",
      "What is List Comprehension? Give an Example.",
      "What is a lambda function?",
      "What is a pass in Python?",
      "What is the difference between / and // in Python?",
      "How is Exceptional handling done in Python?",
      "What is swapcase function in Python?",
      "Difference between for loop and while loop in Python",
      "Can we Pass a function as an argument in Python?",
      "What are *args and *kwargs?",
      "Is Indentation Required in Python?",
      "What is Scope in Python?",
      "What is docstring in Python?",
      "What is a dynamically typed language?",
      "What is a break, continue, and pass in Python?", 
      "What are Built-in data types in Python?",
      "How do you floor a number in Python?",
      "Explain list comprehension in Python.",
      "What are generators in Python?",
      "How do you handle exceptions in Python?",
      "What is the difference between '==' and 'is' in Python?",
      "How do you manage memory in Python?",
      "What are the different types of inheritance in Python?",
      "How do you create a virtual environment in Python?"
    ],
    "Intermediate": [
      "What is the difference between xrange and range functions?",
      "What is Dictionary Comprehension? Give an Example",
      "Is Tuple Comprehension? If yes, how, and if not why?",
      "Differentiate between List and Tuple?",
      "What is the difference between a shallow copy and a deep copy?",
      "Which sorting technique is used by sort() and sorted() functions of python?",
      "What are Decorators?",
      "How do you debug a Python program?",
      "What are Iterators in Python?",
      "What are Generators in Python?",
      "Does Python supports multiple Inheritance?",
      "What is Polymorphism in Python?",
      "Define encapsulation in Python?",
      "How do you do data abstraction in Python?",
      "How is memory management done in Python?",
      "How to delete a file using Python?",
      "What is slicing in Python?",
      "What is a namespace in Python?",
      "What is the use of the 'yield' keyword in Python?",
      "How do you use the 'async' and 'await' keywords in Python?"
    ],
    "Hard": [
      "What are metaclasses in Python?",
      "How do you optimize performance in Python applications?",
      "What is the difference between multithreading and multiprocessing in Python?",
      "How do you use the 'async' and 'await' keywords in Python?",
      "What is the Global Interpreter Lock (GIL) in Python?",
      "How do you manage memory in Python?",
      "How do you use the 'with' statement and context managers in Python?",
      "What are the differences between Python's 'list' and 'array' modules?",
      "How do you work with JSON data in Python?",
      "What is the difference between synchronous and asynchronous programming in Python?"
    ]
  },
  "Kotlin Interview": {
    "Beginner": [
      "What is Kotlin?",
      "How is Kotlin different from Java?",
      "Explain the advantages of using Kotlin.",
      "What are the basic data types in Kotlin?",
      "What is the difference between val and var in Kotlin?",
      "Explain type inference in Kotlin.",
      "What are nullable types in Kotlin?",
      "How do you handle nullability in Kotlin?",
      "What is the Elvis operator in Kotlin?",
      "Explain the concept of smart casts in Kotlin.",
      "What are Kotlin collections?",
      "What is the difference between a list and an array in Kotlin?",
      "How do you create an empty list in Kotlin?",
      "What is the difference between an immutable and a mutable list in Kotlin?",
      "Explain the concepts of immutable and mutable variables in Kotlin.",
      "What is a lambda expression in Kotlin?",
      "Explain the concept of higher-order functions in Kotlin.",
      "What is the use of the lateinit modifier in Kotlin?",
      "What is a data class in Kotlin?",
      "Explain the concept of extension functions in Kotlin.",
      "What is the difference between companion objects and static members in Java?",
      "What is a sealed class in Kotlin?",
      "Explain the concept of object expressions in Kotlin.",
      "What are coroutines in Kotlin?",
      "Explain the suspend modifier in Kotlin.",
      "What is the purpose of the withContext() function in Kotlin coroutines?",
      "How do you handle exceptions in Kotlin coroutines?",
      "What is a flow in Kotlin coroutines?",
      "Explain the concept of lazy initialization in Kotlin.",
      "What is the scope function “let” in Kotlin?"
    ],
    "Intermediate": [
      "What is the scope function “also” in Kotlin?",
      "Explain the scope function “apply” in Kotlin.",
      "What is the scope function “run” in Kotlin?",
      "What is the scope function “run” with receiver in Kotlin?",
      "Explain the concept of functional programming in Kotlin.",
      "What is the use of the reified modifier in Kotlin?",
      "Explain the concept of delegates in Kotlin.",
      "What is a lateinit property in Kotlin?",
      "What is the purpose of the by keyword in Kotlin?",
      "Explain the concept of operator overloading in Kotlin.",
      "What is the purpose of the when expression in Kotlin?",
      "Explain the sealed classes and when expression combination in Kotlin.",
      "What is a primary constructor in Kotlin?",
      "Explain the concept of secondary constructors in Kotlin.",
      "What is the difference between init and constructor in Kotlin?",
      "Explain the concept of generics in Kotlin.",
      "What is the difference between invariance, covariance, and contravariance in Kotlin generics?",
      "Explain the concept of typealias in Kotlin.",
      "What is the difference between “apply” and “also” scope functions in Kotlin?",
      "What are inline functions in Kotlin?"
    ],
    "Hard": [
      "Explain the concept of tail recursion in Kotlin.",
      "What is the purpose of the “!!” operator in Kotlin?",
      "Explain the concept of inline classes in Kotlin.",
      "What is the use of the @JvmStatic annotation in Kotlin?",
      "Explain Kotlin Type-Safe Builders.",
      "What is the difference between “==” and “===” operators in Kotlin?",
      "Explain the concept of property delegation in Kotlin.",
      "What is the purpose of the operator modifier in Kotlin?",
      "Explain the concept of destructuring declarations in Kotlin.",
      "What is the use of the @JvmOverloads annotation in Kotlin?"
    ]
  },
  "ReactJS Interview": {
    "Beginner": [
      "What is React?",
      "What is JSX?",
      "What are props in React?",
      "What is state in React?",
      "How to create components in React?",
      "What is the difference between state and props?",
      "How can you wrap text in Excel?",
      "What is the difference between HTML and React event handling?",
      "What are synthetic events in React?",
      "What is 'key' prop and what is the benefit of using it in arrays of elements?",
      "What is Virtual DOM?",
      "How does Virtual DOM work?",
      "What are controlled components?",
      "What are uncontrolled components?",
      "What is React Fiber?",
      "What are fragments in React?",
      "Why does React use className over the class attribute?",
      "What are Pure Components in React?",
      "What is the children prop in React?",
      "How do you write comments in React?",
      "What are Higher-Order Components (HOC)?",
      "What is the difference between createElement and cloneElement?",
      "How to apply validation on props in React?",
      "What are stateless components?",
      "What are stateful components?",
      "What is the use of the react-dom package?",
      "How to use InnerHtml in React?",
      "How to use styles in React?",
      "What is the impact of indexes as keys?",
      "How do you conditionally render components?"
    ],
    "Intermediate": [
      "What is Lifting State Up in React?",
      "What is reconciliation in React?",
      "How do you memoize a component?",
      "How to implement Server-Side Rendering (SSR)?",
      "What are the recommended ways for static type checking?",
      "What is the difference between React and ReactDOM?",
      "What is ReactDOMServer?",
      "How to enable production mode in React?",
      "What is the difference between useState and useRef hook?",
      "What are the differences between Functional and Class Components?",
      "How to fetch data with React Hooks?",
      "What are hooks?",
      "What rules need to be followed for hooks?",
      "What are the benefits of React Router V4?",
      "How do you handle errors in React components?",
      "What is the purpose of default value in context?",
      "What is the purpose of displayName class property?",
      "What is code-splitting?",
      "What is the benefit of styles modules?",
      "What is React memo function?"
    ],
    "Hard": [
      "How does context work using useContext hook?",
      "What are the use cases of useContext hook?",
      "What is Concurrent Rendering?",
      "What are the differences between useEffect and useLayoutEffect hooks?",
      "What is the proper way to access the Redux store?",
      "What is Redux Thunk?",
      "How to set initial state in Redux?",
      "What is the purpose of registerServiceWorker in React?",
      "How do you access imperative API of web components?",
      "How to re-render the view when the browser is resized?"
    ]
  }
}
